[
  {
    "path": "posts/2021-12-02-is-there-a-seasonal-cycle-to-earthquakes-in-the-eastern-sierra/",
    "title": "Is there a Seasonal Cycle to Earthquakes in the Eastern Sierra?",
    "description": "Exploring the relationship of groundwater and seismic events in Eastern Sierra.",
    "author": [
      {
        "name": "Ryan Munnikhuis",
        "url": "https://ryanmunnikhuis.github.io/blog.html"
      }
    ],
    "date": "2021-12-02",
    "categories": [],
    "contents": "\r\n\r\nIs there a Seasonal Cycle to Earthquakes in the Eastern Sierra?\r\n\r\n\r\n \r\n\r\n\r\nIntroduction\r\n\r\n\r\n\r\n\r\nThe craggy and dramatic mountain tops of the Eastern Sierra Nevada serve as a stark contrast to the low-lying Owen’s Valley to the east. The Eastern Sierra—which stretches from Lone Pine, California, in the south to the Nevada state line in the north—is predominately the result of millions of years of faulting along the mountain range’s base. Unlike many natural phenomena, earthquakes typically occur independently of local environmental conditions. However, one such environmental factor that is thought to affect earthquake likelihood is water (e.g., surficial water and groundwater). \r\n\r\n\r\nWater weight can add to regional stresses and lubricate fault planes, increasing earthquake likelihood. The Eastern Sierra is somewhat unique in being both highly geologically active and having a high variance in seasonal precipitation and snowmelt rates. Therefore, the Eastern Sierra serves as an ideal zone to test if there is a relationship between these two variables. Understanding this relationship can help us better understand the mechanisms behind seismic events. As such, this blog will attempt to answer: “Is there a Seasonal Cycle to Earthquakes in the Eastern Sierra?” using statistical analysis in R. \r\n\r\n\r\nGeology\r\n\r\n\r\n(Brief) Regional Geologic History\r\n\r\n\r\nThe Eastern Sierra Nevada geomorphic landscape had long been dictated by seismic and volcanic activity. Northwestern movement of the Pacific Plate in relation to the North American Plate is accommodated through the San Andreas Fault System. As the Pacific Plate moves northwest,  the North American Plate is pulled with it. Over time, this process has thinned much of western North America, allowing magma in the mantle to come closer to the Earth’s surface. This upwelling of magma increased the elasticity and buoyancy of the lithosphere relative to the surrounding colder, denser crust. This process increased the buoyancy of the eastern portion of the Sierra Nevada formation in relation to the west side, “pushing” the east portion upwards. This upward movement, coupled with the crust’s stretching, was mainly accommodated through faulting (i.e., earthquakes), which continues to this day. \r\n\r\n\r\nEarthquakes Mechanisms\r\n\r\n\r\nWhile earthquakes have many causes, the simplest model boils down to shear stress (perpendicular force) overcoming normal stress (resisting force). Once this occurs, stored elastic strain energy in the rock is released into the neighboring environment, offsetting the fault plane and causing ground-shaking. \r\n\r\n\r\nFluids and Earthquakes\r\n\r\n\r\nThe effects of fluids and earthquakes have long been studied. Fluids can play a key role in controlling fault strength and earthquake rupture potential (M. Violay et al., 2013). On a regional scale, terrestrial and subsurface water volume changes are thought to produce flexural stresses that play a role in seismicity (Carlson et al., 2020; Johnson et al., 2017). Fluids are also believed to interact directly with faults—acting as a lubricant, reducing the normal stress that holds the fault in place, thus increasing earthquake potential. \r\n\r\n\r\nRegional changes in surficial water bodies and groundwater levels can be challenging to calculate. So for the sake of practicality, this blog will test to see if changes in local groundwater elevation near Mammoth Lakes and Crowley Lake affect the frequency of earthquakes in the region. \r\n\r\n\r\nDatasets\r\n\r\n\r\nThe first step to testing this hypothesis was to find sufficient and overlapping datasets for earthquakes and groundwater. I first collected groundwater data using the California Sustainable Groundwater Management Act (SGMA) Data Viewer. This viewer allowed me to draw a bounding box over my region of interest and select what well types I wanted. I chose Mammoth Lakes and Crowley Lake (Figure 1) since there was a high density of wells in this location. Ultimately, my dataset contained 4,369 groundwater observations from 104 wells over a range of 62 years (from 1959-09 to 2021-11). For earthquake data, I used the United States Geological Survey’s (USGS) Search Earthquake Catalog to search for 1.0+ magnitude earthquakes events within the same bounding box as the groundwater observations (Figure 2). However, given the high frequency of 1.0+ earthquakes events and the search limitations of the Earthquake Catalog, I was only able to collect 9,958 earthquake incidents from 1998-11 to 2021-11. \r\n\r\n\r\nBoth datasets contain excellent metadata, including observation review status, comments, contact information,  and explanations of how the data was collected. \r\n\r\n\r\nFigure 1, SGMA Bounding Box of Study Area \r\n\r\n\r\n\r\n\r\nFigure 2, USGS Bounding Box of Study Area \r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\nStatistical Analysis\r\n\r\n\r\nAnalysis Plan \r\n\r\n\r\nTo test my hypothesis, I used various methods to explore the relationship between seasonality and earthquakes and the relationship between groundwater depth and earthquake frequency. These methods include:\r\n\r\n\r\nFrequency diagrams to contextualize data;\r\n\r\n\r\nTime series plots to verify if seasonality is present; \r\n\r\n\r\nClassical additive decomposition models to determine the magnitude of seasonality; and \r\n\r\n\r\nSimple linear regression model to determine if there is a correlation between monthly mean groundwater elevations and earthquake frequencies. \r\n\r\n\r\nBelow, I detail the linear progression of exploring my hypothesis as well as how each model was used for this analysis.  \r\n\r\n\r\nFrequency Diagram\r\n\r\n\r\nNow that I have collected overlapping groundwater and earthquake data, I was interested to see if any months had abnormally high earthquake frequency compared to others. To do so, I created a column in my earthquake dataset that contained only the month in which each seismic event occurred. I then plotted a histogram of the earthquake frequency per month using the geom_plot() function found in the {ggplot2} package (Figure 3). \r\n\r\n\r\nFigure 3, Monthly Earthquake Frequency Histogram\r\n\r\n\r\n\r\n\r\nInterestingly enough, we see that September, and to a lesser degree July, have a higher frequency of earthquake events in the region than other months. However, I was not yet convinced that there is a seasonal variance in earthquakes. Let’s take this one step further and look at the seasonality of our earthquake data. \r\n\r\n\r\nSeasonality \r\n\r\n\r\nTo look at the seasonality of the earthquake dataset, I first needed to subset the earthquake data by the frequency of earthquake per year and month of occurrence. Then, I coerced my subsetted data into a time-series object and plotted using the ts() function, which is included in the {stats} package (Figure 4).\r\n\r\n\r\nFigure 4, Time Series Plot of Earthquake Dataset\r\n\r\n\r\n\r\n\r\nIt appears that two earthquake clusters, one near 2003 and one near 2007, can potentially explain the abnormally high frequency of seismic events in September and July seen in Figure 3. \r\n\r\n\r\nDecomposition\r\n\r\n\r\nBased on Figure 4, the likelihood of seasonal variance is low for this dataset. But let’s confirm this by running a classical additive decomposition model using the classical_decomposition() function from the {feasts} package (Figure 5). \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\nFigure 5, Decomposition Plot of Earthquake Dataset \r\n\r\n\r\n\r\n\r\nThe grey bars on the side of the decomposition plot represent the same size and help you assess each component’s magnitude. Thus, when the bar is small relative to the variation shown in a plot, that component is quantitatively important in determining overall variation. Based on this assumption, it appears that earthquakes contained in this dataset are randomly occurring. \r\n\r\n\r\nWinsorization\r\n\r\n\r\nFor fun, let’s winsorize our earthquake dataset to the 99th percentile and see how our seasonality would change (Figure 6; Figure 7). Winsorization replaces all observations above a select percentile with the value of the selected percentile. This transformation is typically done if you have reason to believe your dataset has spurious outliers. All of the observations are undoubtedly believable, but cluster events like those seen in Figure 4 can overshadow subtler trends in data. So for the sake of argument, let’s see if winsorizing the data would make a difference in the outcome.  \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n\r\nFigure 6, 99th Percentile Winsorization of Earthquake Dataset \r\n\r\n\r\n\r\n\r\nFigure 7, Decomposition Plot of 99th Percentile Winsorization of Earthquake Dataset \r\n\r\n\r\n\r\n\r\nEven when the data is winsorized, we see that classical additive decomposition suggests that randomness plays a much greater role than seasonality. This further reinforces that there is little to no seasonal variance of earthquakes in this dataset. \r\n\r\n\r\nLinear Regression\r\n\r\n\r\nWhile there appears to be little or no seasonality of earthquakes in this dataset, perhaps we can still correlate the monthly mean groundwater levels and the frequency of earthquake events using a simple linear regression model. First, let’s determine if the ordinary least square (OLS) assumptions are met. \r\n\r\n\r\n1. We are assuming a linear relationship between the independent and dependent values;\r\n\r\n\r\n2. We are assuming that there is no variable correlated with the independent and dependent values;\r\n\r\n\r\n3. There is variation in the independent value; and \r\n\r\n\r\n4. There is heteroscedasticity (i.e., randomness in variance). \r\n\r\n\r\nNext, I need to append the frequency dataset with the mean groundwater elevation of the region with the same month and year as the earthquakes.\r\n\r\n\r\nNow I can finally run a linear regression model using the lm() function found in the {stats} packages (Figure 8; Figure 9). \r\n\r\n\r\nFigure 8, Simple Linear Regression Model of Earthquake Frequency to Mean Groundwater Depth\r\n\r\nFigure 9, Simple Linear Regression Summary of Earthquake Frequency to Mean Groundwater Depth\r\n\r\n\r\n\r\n\r\n\r\nHere we see that the adjusted R-squared value is negative, suggesting that the selected model does not follow the trend. In other words, this model is a poor fit between the two datasets. Moreover, if we look at the p-value, the probability of obtaining test results at least as extreme as the results actually observed,  we see that the value is close to 1.0. To reject the null hypothesis, we would ideally have a p-value under 0.05. I think it’s fair to say that there is no correlation between earthquake frequency and monthly mean groundwater elevation under these conditions. \r\n\r\n\r\nDiscussion \r\n\r\n\r\nWhile this blog failed to find a correlation between seasonality and earthquake occurrence and groundwater depth and earthquake frequency, many more tests would need to be done to prove that these relationships do not exist. Likely, the current model is an oversimplification of a complex relationship.  For example, perhaps the subsurface fault planes in the Mammoth Lakes and Crowley Lake region are year-round at or below the water table, meaning that the frictional coefficient of the fault plane is unchanging by seasonal variances in groundwater. Moreover, groundwater elevation varies dramatically throughout a region, so taking the average over the area may be oversimplifying the model too much. Or maybe groundwater’s interaction with fault planes results in microseismic events (<1.0 magnitude earthquakes), which were not captured in the dataset.  \r\n\r\n\r\nUltimately, this process was an excellent first step in defining the interest parameters and contextualizing the hypothesis. I believe that refining my groundwater model and incorporating <1.0 magnitude earthquakes into my analysis can help address some of the previously identified problems. Even more so, I believe that combining regional datasets will help refine the relationship between groundwater and seismic events.  \r\n\r\n\r\n \r\n\r\n\r\nReferences\r\n\r\n\r\nChristopher W. Johnson, Yuning Fu, Roland Bürgmann. 2017. Seasonal water storage, stress modulation, and California seismicity. https://www.science.org/doi/pdf/10.1126/science.aak9547\r\n\r\n\r\nDepartment of Water Resources. 2021. “SGMA Data Viewer.” Accessed 2021-11-25. https://sgma.water.ca.gov/webgis/?appid=SGMADataViewer#currentconditions\r\n\r\n\r\nG. Carlson,  M. Shirzaei, S. Werth, G. Zhai, C. Ojha. 2020. Seasonal and Long-Term Groundwater Unloading in the Central Valley Modifies Crustal Stress. https://doi.org/10.1029/2019JB018490. ;\r\n\r\n\r\nM. Violay, S. Nielsen,   B. Gibert, E. Spagnuolo, A. Cavallo, P. Azais,  S. Vinciguerra, Sergio, G. Di Toro. 2013. Effect of water on the frictional behavior of cohesive rocks during earthquakes. https://www.researchgate.net/publication/259591536_Effect_of_water_on_the_frictional_behavior_of_cohesive_rocks_during_earthquakes\r\n\r\n\r\nUSGS (United States Geological Survey). 2021. “Search Earthquake Catalog.” Accessed 2021-11-25. https://earthquake.usgs.gov/earthquakes/search/\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-02T16:19:40-08:00",
    "input_file": {}
  }
]
